FR 1 : 관리자로서 웹페이지에서 관리자 계정(id, 비밀번호 입력)으로 로그인하여 관리자 시스템에 접속할 수 있다.
FR 2 : 허락되지 않은 사람(관리자 계정 외의 다른 계정)은 관리자 시스템에 접근할 수 없다.
FR 3 : 관리자로서 로그인 시 전체 직원 리스트를 확인할 수 있다. 
FR 4 : 관리자로서 직원 관리를 위해 직원을 추가할 수 있다.
FR 5 : 관리자로서 직원을 추가할 때 이름, 전화번호, id(직원번호), 비밀번호, 급여 옵션을 입력한다.
FR 6 : 관리자로서 급여 옵션 설정을 위해 월급/시급 여부 선택, 월급/시급 액수를 입력 할 수 있다.
FR 7 : 관리자로서 직원 관리를 위해 직원을 삭제할 수 있다.
FR 8 : 직원을 잘못 삭제하는 경우를 줄이기 위해 해당 직원을 삭제할 것인지 재차 확인받는다.
FR 9 : 관리자로서 직원 정보를 찾기 위해 직원 리스트에서 정보를 원하는 직원을 클릭 시 직원 정보를 확인할 수 있다. 
FR 10 : 관리자로서 효율적으로 직원 정보를 찾기 위해 직원의 이름 또는 id를 통해 검색할 수 있다.
FR 11 : 직원 정보는 이름, 전화번호, id, 비밀번호, 근무시간, 급여, 급여 옵션을 포함한다.
FR 12 : 관리자로서 직원의 직원 id, 근무시간, 급여를 제외한 정보를 수정할 수 있다.
FR 13 : 관리자로서 비밀번호를 수정할 시 수정된 비밀번호가 직원에게 자동적으로 보내진다.
FR 14 : 관리자로서 직원정보를 추가할 시 id와 비밀번호가 직원에게 자동적으로 보내진다.
FR 15 : 관리자로서 모든 직원의 급여와 근무시간을 확인할 수 있다.
FR 16 : 상단에 있는 '뒤로 가기' 버튼을 클릭하여 이전 페이지로 돌아갈 수 있다.
NFR 1 : 이 시스템은 간단한 프로세스와 직관적인 UI를 통해 직원 정보 관리 및 급여 확인을 쉽게 할 수 있도록 돕는다.




